<style lang="less" scoped>
footer {
    background-color: #ecf6fe;
    margin-top: 150px;
    .wrap {
        max-width: 1296px;
        margin: auto;

        .top {
            display: flex;
            justify-content: space-between;
            align-items: center;

            .title {
                font-size: 20px;
                font-weight: 500;
                color: #0d0c22;
                margin-bottom: 24px;
                cursor: pointer;
            }

            .desc {
                font-size: 14px;
                color: #707783;
                margin-bottom: 20px;
                max-width: 434px;
                cursor: pointer;
            }

            .social {
                width: 35%;
                display: flex;
                justify-content: space-between;
                align-items: center;

                svg {
                    cursor: pointer;
                    fill: #707783;
                }
            }

            .shop-block {
                margin-top: 40px;
                display: flex;
                justify-content: space-between;
                align-items: center;

                .shop {
                    margin-right: 140px;
                }
            }
        }

        .line {
            width: 100%;
            height: 2px;
            background-color: #707783;
            border: none;
            opacity: .1;
            margin-bottom: 24px;
            margin-top: 48px;
        }
        .bot {
            display: flex;
            font-size: 14px;
            color: #707783;
            padding-bottom: 60px;
            svg {
                cursor: pointer;
                fill: #707783;
            }
            .bot-text {
                margin-right: 24px;
                cursor: pointer;
            }
        }
    }

}
</style>

<template>
    <footer>
        <div class="wrap">
            <div class="top">
                <div class="info-shop">
                    <div class="title">Книжный интернет-магазин «Читай-город»</div>
                    <div class="desc">
                        «Читай-город» – сеть книжных магазинов, успешно работающих в Москве и других регионах
                        России.
                    </div>
                    <div class="desc">
                        А ещё это – крупный интернет-магазин книг. В нём вы можете заказывать книги в любое
                        время 24 часа в сутки.
                    </div>
                    <div class="social">
                        <svg width="24" height="24" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"
                            class="social__icon">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                d="M20.576 7.738c.134-.416 0-.72-.59-.72h-1.964c-.496 0-.724.266-.858.55 0 0-1.01 2.422-2.421 3.993-.457.454-.667.606-.915.606-.133 0-.305-.152-.305-.568v-3.88c0-.492-.152-.719-.572-.719H9.863c-.305 0-.496.227-.496.454 0 .473.705.587.782 1.912v2.877c0 .624-.115.738-.362.738-.668 0-2.288-2.442-3.26-5.224C6.337 7.208 6.145 7 5.65 7H3.667C3.095 7 3 7.265 3 7.549c0 .51.667 3.085 3.107 6.491 1.62 2.328 3.927 3.577 6.005 3.577 1.258 0 1.411-.283 1.411-.757V15.1c0-.567.114-.662.515-.662.286 0 .8.151 1.963 1.268 1.335 1.325 1.563 1.93 2.307 1.93h1.963c.572 0 .84-.284.687-.832-.172-.55-.82-1.344-1.659-2.29-.457-.53-1.144-1.117-1.353-1.4-.286-.38-.21-.53 0-.872-.02 0 2.383-3.368 2.63-4.504z">
                            </path>
                        </svg>
                        <svg width="24" height="24" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"
                            class="social__icon">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                d="M15.508 12.658c.65-.401 1.507-.21 1.915.428a1.345 1.345 0 01-.436 1.876 8.964 8.964 0 01-2.752 1.118l2.65 2.597a1.34 1.34 0 010 1.924 1.407 1.407 0 01-1.963 0l-2.604-2.552-2.603 2.552a1.4 1.4 0 01-.982.399 1.4 1.4 0 01-.981-.399 1.342 1.342 0 010-1.924L10.4 16.08a8.98 8.98 0 01-2.751-1.118 1.345 1.345 0 01-.435-1.876 1.403 1.403 0 011.914-.428 6.12 6.12 0 006.38 0zM12.318 3c2.614 0 4.74 2.084 4.74 4.646 0 2.561-2.126 4.644-4.74 4.644-2.613 0-4.739-2.083-4.739-4.644C7.579 5.084 9.705 3 12.319 3zm0 2.723c-1.081 0-1.962.862-1.962 1.923 0 1.06.881 1.923 1.962 1.923 1.082 0 1.963-.863 1.963-1.923s-.88-1.923-1.963-1.923z">
                            </path>
                        </svg>
                        <svg width="24" height="24" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"
                            class="social__icon">
                            <path
                                d="M20.63 7.972a2.255 2.255 0 00-1.587-1.587C17.634 6 12 6 12 6s-5.634 0-7.043.37a2.302 2.302 0 00-1.586 1.602C3 9.381 3 12.302 3 12.302s0 2.935.37 4.329a2.255 2.255 0 001.587 1.586c1.424.386 7.043.386 7.043.386s5.634 0 7.043-.37a2.255 2.255 0 001.586-1.587c.37-1.409.37-4.33.37-4.33s.016-2.935-.37-4.344z">
                            </path>
                            <path d="M14.891 12.302l-4.685-2.698V15l4.685-2.699z" fill="#fff" class="play"></path>
                        </svg>
                        <svg width="24" height="24" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"
                            class="social__icon">
                            <path
                                d="M19.002 8.136a4.401 4.401 0 01-2.6-.84 4.164 4.164 0 01-1.636-2.514A4.01 4.01 0 0114.682 4h-2.79v7.37l-.003 4.037c0 1.079-.729 1.993-1.734 2.316a2.597 2.597 0 01-2.092-.223 2.423 2.423 0 01-1.233-2.058c-.02-1.364 1.12-2.478 2.53-2.478.277 0 .544.045.795.122V10.353a5.519 5.519 0 00-.806-.058c-1.543 0-2.987.62-4.02 1.738a4.988 4.988 0 00-1.319 3.054c-.093 1.483.468 2.895 1.557 3.935.16.152.328.294.505.427a5.465 5.465 0 003.277 1.073c.271 0 .542-.02.806-.059a5.407 5.407 0 002.977-1.44 4.968 4.968 0 001.567-3.594l-.014-6.03a7.236 7.236 0 004.324 1.419V8.133c.003.003-.007.003-.007.003z">
                            </path>
                        </svg>
                        <svg width="24" height="24" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"
                            class="social__icon">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                d="M4.237 11.422c4.832-2.105 8.054-3.493 9.666-4.164 4.603-1.914 5.56-2.247 6.183-2.258.137-.002.444.032.642.193.168.136.214.32.236.449.022.129.05.423.028.652-.25 2.621-1.329 8.981-1.878 11.916-.232 1.242-.69 1.659-1.133 1.7-.962.088-1.693-.636-2.625-1.247-1.459-.957-2.283-1.552-3.7-2.485-1.636-1.079-.575-1.671.358-2.64.244-.253 4.485-4.11 4.567-4.46.01-.044.02-.208-.077-.294s-.24-.056-.343-.033c-.147.033-2.477 1.574-6.992 4.621-.661.454-1.26.675-1.797.664-.592-.013-1.73-.335-2.577-.61-1.038-.337-1.862-.515-1.79-1.089.037-.298.448-.603 1.232-.915z">
                            </path>
                        </svg>
                    </div>
                </div>
                <div class="shop-block">
                    <div class="shop">
                        <div class="title">В наших магазинах</div>
                        <div class="desc">Адреса магазинов</div>
                        <div class="desc">Услуги</div>
                        <div class="desc">Наши партнеры</div>
                        <div class="desc">О компании</div>
                        <div class="desc">Хотите у нас работать?</div>
                    </div>
                    <div class="internet-shop">
                        <div class="title">В интернет-магазине</div>
                        <div class="desc">Доставка и оплата</div>
                        <div class="desc">Бонусная программа</div>
                        <div class="desc">Вопросы и ответы</div>
                        <div class="desc">Обратная связь</div>
                        <div class="desc">Акции</div>
                    </div>
                </div>
            </div>
            <div class="line"></div>
            <div class="bot">
                <p class="bot-text">© 2023, Читай-город</p>
                <p class="bot-text">Правила продажи</p>
                <p class="bot-text">Политика конфиденциальности</p>
                <p class="bot-text">Принимаем к оплате</p>
                <p class="bot-text">
                    <svg width="30px" height="14px" viewBox="0 0 30 14" fill="none" xmlns="http://www.w3.org/2000/svg"
                        class="footer-bottom__icon">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M8.017 2.625v.004c-.009 0-1.163-.002-1.471 1.103a1207.36 1207.36 0 01-1.103 3.894h-.221s-.817-2.864-1.103-3.898c-.31-1.107-1.471-1.103-1.471-1.103H0v8.421h2.648V6.045h.22l1.545 5.001h1.839L7.796 6.05h.22v4.997h2.648V2.625H8.017zm9.671 0s-.776.07-1.14.883l-1.875 4.118h-.221V2.625h-2.648v8.421h2.5s.813-.073 1.178-.882l1.838-4.119h.22v5.001h2.649V2.625h-2.501zm3.678 8.421V6.45h8.219a2.865 2.865 0 01-2.703 1.913h-2.869v2.684h-2.647z"
                            fill="#707783"></path>
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M26.882 2.625h-5.888a4.23 4.23 0 004.16 3.457h4.537a2.867 2.867 0 00-2.81-3.457z"
                            fill="#707783"></path>
                    </svg>
                </p>
                <p class="bot-text">
                    <svg width="30px" height="14px" viewBox="0 0 30 14" fill="none" xmlns="http://www.w3.org/2000/svg"
                        class="footer-bottom__icon">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M15.386 5.696c-.017 1.339 1.193 2.085 2.104 2.53.936.455 1.25.747 1.247 1.154-.007.624-.747.9-1.44.91-1.207.019-1.91-.326-2.468-.587l-.435 2.036c.56.258 1.598.483 2.673.493 2.525 0 4.177-1.246 4.186-3.178.01-2.453-3.392-2.589-3.37-3.685.009-.332.326-.687 1.021-.777.344-.045 1.294-.08 2.37.416l.422-1.97a6.442 6.442 0 00-2.249-.413c-2.376 0-4.048 1.263-4.061 3.071zm10.37-2.901c-.46 0-.849.269-1.022.681l-3.607 8.611h2.523l.502-1.387h3.083l.291 1.387h2.224l-1.94-9.292h-2.053zm.354 2.51l.728 3.49h-1.994l1.266-3.49zm-13.783-2.51l-1.988 9.292h2.404l1.987-9.292h-2.403zm-3.556 0L6.269 9.12 5.256 3.742c-.118-.6-.587-.947-1.108-.947H.058L0 3.065c.84.182 1.794.476 2.372.79.354.192.455.36.57.817l1.918 7.415H7.4l3.895-9.292H8.771z"
                            fill="#707783"></path>
                    </svg>
                </p>
            </div>
        </div>
    </footer>
</template>

<script>
export default {

}   
</script>